Repository: rosix-ru/django-quickapi
Catalog: quickapi/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Application Programming Interface
ru: Интерфейс Программирования Приложения

source: This method incorrectly configured.
ru: Этот метод неправильно настроен

source: This method not responsible on %s request.
ru: Этот метод не отвечает на %s запрос.

source: This method works without AJAX.
ru: Этот метод работает без AJAX.

source: This method works with AJAX only.
ru: Этот метод работает только с AJAX.

source: Continue
ru: Продолжить

source: Switching Protocols
ru: Переключение протоколов

source: Processing
ru: Идёт обработка

source: OK
ru: Хорошо

source: Created
ru: Создано

source: Accepted
ru: Принято

source: Non-Authoritative Information
ru: Информация не авторитетна

source: No Content
ru: Нет содержимого

source: Reset Content
ru: Сбросить содержимое

source: Partial Content
ru: Частичное содержимое

source: Multi-Status
ru: Многостатусный

source: IM Used
ru: Использовано IM

source: Multiple Choices
ru: Множество выборов

source: Moved Permanently
ru: Перемещено навсегда

source: Found
ru: Найдено

source: See Other
ru: Смотреть другое

source: Not Modified
ru: Не изменялось

source: Use Proxy
ru: Использовать прокси

source: Temporary Redirect
ru: Временное перенаправление

source: Bad Request
ru: Плохой запрос

source: Unauthorized
ru: Не авторизован

source: Payment Required
ru: Требуется оплата

source: Forbidden
ru: Запрещено

source: Not Found
ru: Не найдено

source: Method Not Allowed
ru: Метод не доступен

source: Not Acceptable
ru: Не приемлемо

source: Proxy Authentication Required
ru: Необходима аутентификация прокси

source: Request Timeout
ru: Истекло время ожидания

source: Conflict
ru: Конфликт

source: Gone
ru: Удалён

source: Length Required
ru: Необходима длина

source: Precondition Failed
ru: Условие ложно

source: Request Entity Too Large
ru: Размер запроса слишком велик

source: Request-URI Too Large
ru: Запрашиваемый URI слишком длинный

source: Unsupported Media Type
ru: Неподдерживаемый тип данных

source: Requested Range Not Satisfiable
ru: Запрашиваемый диапазон не достижим

source: Expectation Failed
ru: Ожидаемое неприемлемо

source: Unprocessable Entity
ru: Необрабатываемый экземпляр

source: Locked
ru: Заблокировано

source: Failed Dependency
ru: Невыполненная зависимость

source: Unordered Collection
ru: Неупорядоченный набор

source: Upgrade Required
ru: Необходимо обновление

source: Retry With
ru: Повторить с

source: Unrecoverable Error
ru: Некорректируемая ошибка

source: Internal Server Error
ru: Внутренняя ошибка сервера

source: Not Implemented
ru: Не реализовано

source: Bad Gateway
ru: Плохой, ошибочный шлюз

source: Service Unavailable
ru: Сервис недоступен

source: Gateway Timeout
ru: Шлюз не отвечает

source: HTTP Version Not Supported
ru: Версия HTTP не поддерживается

source: Variant Also Negotiates
ru: Вариант тоже проводит согласование

source: Insufficient Storage
ru: Переполнение хранилища

source: Loop Detected
ru: Обнаружена петля

source: Bandwidth Limit Exceeded
ru: Исчерпана пропускная ширина канала

source: Not Extended
ru: не расширено

source: Undefined message
ru: Неопределённое сообщение

source: Methods
ru: Методы

source: Namespace
ru: Пространство имён

source: no description available
ru: описание отсутствует

source: This is short non-official localized text of license. Please, read full official text.
ru: Это краткий неофициальный локализованный текст лицензии. Пожалуйста, прочитайте полный официальный текст.

source: QuickAPI is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
ru: QuickAPI это свободная программа: Вы можете перераспространять ее и/или изменять ее на условиях Стандартной общественной лицензии GNU Афферо в том виде, в каком она была опубликована Фондом свободного программного обеспечения; либо версии 3 лицензии, либо (по Вашему выбору) любой более поздней версии.

source: QuickAPI is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more details.
ru: QuickAPI распространяется в надежде, что она будет полезной, но БЕЗО ВСЯКИХ ГАРАНТИЙ; даже без неявной гарантии ТОВАРНОГО ВИДА или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ. Подробнее см. в Стандартной общественной лицензии GNU Афферо.

source: You should have received a copy of the GNU Affero General Public License along with QuickAPI. If not, see
ru: Вы должны были получить копию Стандартной общественной лицензии GNU Афферо вместе с QuickAPI. Если это не так, см.

source: Close
ru: Закрыть

source: License
ru: Лицензия

source: GNU Affero General Public License
ru: Стандартная общественная лицензия GNU Афферо

source: Full official text
ru: Полный официальный текст

source: Get the code
ru: Получить код

source: Toggle navigation
ru: Переключение навигации

source: The documentation for API
ru: Документация для API

source: Requests
ru: Запросы

source: Responses
ru: Ответы

source: Query parameters can be transmitted in a single JSON object via POST
ru: Параметры запроса можно передать в одном JSON-объекте через POST

source: Authorization settings everywhere are optional.
ru: Параметры авторизации везде являются необязательными.

source: For example, if the request object stores a user session, then authentication occurs on these data.
ru: Так, например, если объект запроса хранит сессию пользователя, то авторизация происходит по этим данным.

source: Example
ru: Пример

source: for
ru: для

source: Parameters, you can pass directly into the POST-query.
ru: Параметры можно передавать непосредственно в POST-запросе.

source: In this variant, you can only pass lists and simple values.
ru: В этом варианте можно передавать только простые списки и значения.

source: Key "key3" in this case, jQuery will automatically change to "key3[]".
ru: Ключ "key3" в этом случае, jQuery автоматически заменит на "key3[]".

source: In this variant, you can transfer any serializable objects.
ru: В этом варианте можно передавать любые сериализуемые объекты.

source: To properly serialize dates in JSON is better to use special
ru: Для правильной сериализации дат в JSON лучше использовать специальный

source: with HTTP Basic authorization
ru: с HTTP Basic авторизацией

source: without HTTP Basic authorization
ru: без HTTP Basic авторизации

source: The general structure of the answers
ru: Общая структура ответов

source: Codes HTTP that makes sense.
ru: Коды HTTP, имеющие смысл.

source: The message string for the user (with support for localization)
ru: Строка сообщения для пользователя (с поддержкой локализации)

source: Nested object
ru: Вложенный объект

source: The type and structure of nested object depend on the method to call (see documentation below).
ru: Тип и структура вложенного объекта зависят от вызываемого метода (см. документацию ниже).

source: API documentation
ru: Документация API

source: QuickAPI - it's Django-application for the fast organization API.
ru: QuickAPI - это Django-приложение для быстрой организации API.

source: Back on top
ru: Наверх

source: Project
ru: Проект

source: Missing.
ru: Отсутствуют.

source: ### Functional assignment %(header)s ### Request parameters %(params)s ### Returned object %(data)s %(footer)s
ru: ### Функциональное назначение %(header)s ### Параметры запроса %(params)s ### Возвращаемый объект %(data)s %(footer)s

source: if success or
ru: если успешно, иначе

source: if not success or
ru: если не успешно, иначе

source: if exists or
ru: если существует, иначе

source: if not exists or
ru: если не существует, иначе

source: primary key
ru: первичный ключ

source: name of field
ru: имя поля

source: new value for field
ru: новое значение для поля

source: filters
ru: фильтры

source: ordering
ru: сортировка

source: page number
ru: номер страницы

source: objects per page
ru: объектов на страницу

source: list of objects
ru: список объектов

source: or specific information
ru: или специальная информация

source: Test response. Redirect to %s.
ru: Тестовый ответ. Перенаправление на %s.

source: Test response. Error %d.
ru: Тестовый ответ. Ошибка %d.

source: String in your localization
ru: Строка в вашей локализации

source: Hidden in not debug mode
ru: Скрыто в debug-режиме

source: Test response.
ru: Тестовый ответ.

source: versions of components
ru: версии компонентов

source: *In debug mode shows the settings. Here are the default.*
ru: *В debug-режиме показывает настройки. Здесь приведены по-умолчанию.*

source: Method `%s` does not exist
ru: Метод `%s` не существует
